{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of119.bin", "group1-shard2of119.bin", "group1-shard3of119.bin", "group1-shard4of119.bin", "group1-shard5of119.bin", "group1-shard6of119.bin", "group1-shard7of119.bin", "group1-shard8of119.bin", "group1-shard9of119.bin", "group1-shard10of119.bin", "group1-shard11of119.bin", "group1-shard12of119.bin", "group1-shard13of119.bin", "group1-shard14of119.bin", "group1-shard15of119.bin", "group1-shard16of119.bin", "group1-shard17of119.bin", "group1-shard18of119.bin", "group1-shard19of119.bin", "group1-shard20of119.bin", "group1-shard21of119.bin", "group1-shard22of119.bin", "group1-shard23of119.bin", "group1-shard24of119.bin", "group1-shard25of119.bin", "group1-shard26of119.bin", "group1-shard27of119.bin", "group1-shard28of119.bin", "group1-shard29of119.bin", "group1-shard30of119.bin", "group1-shard31of119.bin", "group1-shard32of119.bin", "group1-shard33of119.bin", "group1-shard34of119.bin", "group1-shard35of119.bin", "group1-shard36of119.bin", "group1-shard37of119.bin", "group1-shard38of119.bin", "group1-shard39of119.bin", "group1-shard40of119.bin", "group1-shard41of119.bin", "group1-shard42of119.bin", "group1-shard43of119.bin", "group1-shard44of119.bin", "group1-shard45of119.bin", "group1-shard46of119.bin", "group1-shard47of119.bin", "group1-shard48of119.bin", "group1-shard49of119.bin", "group1-shard50of119.bin", "group1-shard51of119.bin", "group1-shard52of119.bin", "group1-shard53of119.bin", "group1-shard54of119.bin", "group1-shard55of119.bin", "group1-shard56of119.bin", "group1-shard57of119.bin", "group1-shard58of119.bin", "group1-shard59of119.bin", "group1-shard60of119.bin", "group1-shard61of119.bin", "group1-shard62of119.bin", "group1-shard63of119.bin", "group1-shard64of119.bin", "group1-shard65of119.bin", "group1-shard66of119.bin", "group1-shard67of119.bin", "group1-shard68of119.bin", "group1-shard69of119.bin", "group1-shard70of119.bin", "group1-shard71of119.bin", "group1-shard72of119.bin", "group1-shard73of119.bin", "group1-shard74of119.bin", "group1-shard75of119.bin", "group1-shard76of119.bin", "group1-shard77of119.bin", "group1-shard78of119.bin", "group1-shard79of119.bin", "group1-shard80of119.bin", "group1-shard81of119.bin", "group1-shard82of119.bin", "group1-shard83of119.bin", "group1-shard84of119.bin", "group1-shard85of119.bin", "group1-shard86of119.bin", "group1-shard87of119.bin", "group1-shard88of119.bin", "group1-shard89of119.bin", "group1-shard90of119.bin", "group1-shard91of119.bin", "group1-shard92of119.bin", "group1-shard93of119.bin", "group1-shard94of119.bin", "group1-shard95of119.bin", "group1-shard96of119.bin", "group1-shard97of119.bin", "group1-shard98of119.bin", "group1-shard99of119.bin", "group1-shard100of119.bin", "group1-shard101of119.bin", "group1-shard102of119.bin", "group1-shard103of119.bin", "group1-shard104of119.bin", "group1-shard105of119.bin", "group1-shard106of119.bin", "group1-shard107of119.bin", "group1-shard108of119.bin", "group1-shard109of119.bin", "group1-shard110of119.bin", "group1-shard111of119.bin", "group1-shard112of119.bin", "group1-shard113of119.bin", "group1-shard114of119.bin", "group1-shard115of119.bin", "group1-shard116of119.bin", "group1-shard117of119.bin", "group1-shard118of119.bin", "group1-shard119of119.bin"], "weights": [{"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._0/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._1/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._2/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._3/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._4/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._5/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._6/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._7/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._8/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._9/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._10/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/encoder/layer_._11/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/embeddings/word_embeddings/weight", "shape": [50265, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/embeddings/token_type_embeddings/embeddings", "shape": [1, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/embeddings/position_embeddings/embeddings", "shape": [514, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/embeddings/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/roberta/embeddings/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/classifier/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/classifier/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/classifier/out_proj/kernel", "shape": [768, 9], "dtype": "float32"}, {"name": "tf_roberta_for_sequence_classification/classifier/out_proj/bias", "shape": [9], "dtype": "float32"}]}]}